# Data Selection & Filtering in Pandas

Selecting the right **rows and columns** is the first step in analyzing any dataset.  
Pandas provides several **powerful and flexible** ways to access and filter data efficiently.

---

## ðŸŽ¯ Selecting Rows & Columns

### Selecting Columns

```python
df["column_name"]      # Single column (as Series)
df[["col1", "col2"]]   # Multiple columns (as DataFrame)
```

Example:
```python
df["Name"]
df[["Name", "Age"]]
```

---

## ðŸ”¢ Selecting Rows by Index

Pandas provides two primary methods:

- **`.loc[]` â†’ Label-based access** (uses row/column labels)
- **`.iloc[]` â†’ Position-based access** (uses integer positions)

```python
df.loc[0]     # First row (by label)
df.iloc[0]    # First row (by position)
```

---

## ðŸŽ¯ Selecting Specific Rows and Columns

```python
df.loc[0, "Name"]   # Value at row 0, column 'Name'
df.iloc[0, 1]       # Value at row 0, column at index 1
```

### Slicing Rows and Columns

```python
df.loc[0:2, ["Name", "Age"]]  # Rows 0 to 2, specific columns
df.iloc[0:2, 0:2]             # Rows and columns by position
```

---

## âš¡ Fast Access: `.at[]` and `.iat[]`

These methods are optimized for **single-element** access (faster than `.loc` or `.iloc`).

```python
df.at[0, "Name"]   # Fast label-based access
df.iat[0, 1]       # Fast position-based access
```

---

## ðŸ” Filtering Data with Conditions

### Simple Condition

```python
df[df["Age"] > 30]
```

### Multiple Conditions (AND / OR)

```python
df[(df["Age"] > 25) & (df["City"] == "Delhi")]
df[(df["Name"] == "Bob") | (df["Age"] < 30)]
```

ðŸ§  **Tip:** Always use **parentheses** around each condition when combining them.

---

## ðŸ§¾ Querying Data with `.query()`

The `.query()` method provides a **clean, SQL-like syntax** for filtering rows.  
Itâ€™s more **readable and concise** than traditional boolean indexing.

### Example:

```python
df.query("Age > 25 and City == 'Delhi'")
```

You can even use dynamic variables:

```python
col = "Age"
df.query(f"{col} > 25")
```

---

## ðŸ§  Rules and Tips for Using `.query()`

### 1. Column names become variables
You can reference them directly:

```python
df.query("age > 25 and city == 'Delhi'")
```

### 2. String values must be in quotes
```python
df.query("name == 'Harry'")
df.query('city == "Mumbai"')
```

### 3. Use backticks for columns with spaces or special characters
```python
df.query("`first name` == 'Alice'")
```

### 4. Use `@` to reference Python variables
```python
age_limit = 30
df.query("age > @age_limit")
```

### 5. Logical Operators
| Operator | Use in `.query()` | Example |
|-----------|------------------|----------|
| `and` | Logical AND | `age > 30 and city == 'Delhi'` |
| `or` | Logical OR | `city == 'Delhi' or city == 'Mumbai'` |
| `not` | Negation | `not (age > 40)` |

âŒ **Bad:**  
```python
df.query("age > 30 & city == 'Delhi'")
```
âœ… **Good:**  
```python
df.query("age > 30 and city == 'Delhi'")
```

### 6. Chained Comparisons
```python
df.query("25 < age <= 40")
```

### 7. Avoid reserved keywords as column names
If you have columns like `class`, `lambda`, etc., use backticks:
```python
df.query("`class` == 'Physics'")
```

### 8. Case Sensitivity
Both column names and string values are **case-sensitive**:
```python
df.query("City == 'delhi'")  # âŒ if actual value is 'Delhi'
```

### 9. `.query()` returns a copy, not a view
```python
filtered = df.query("age < 50")
```

Changes to `filtered` **wonâ€™t affect** the original `df` unless reassigned.

---

## âœ… Summary

| Concept | Example | Description |
|----------|----------|-------------|
| Select columns | `df["col"]`, `df[["col1", "col2"]]` | Choose one or more columns |
| Select rows | `df.loc[]`, `df.iloc[]` | Access by label or position |
| Single value | `df.at[]`, `df.iat[]` | Fast single-element access |
| Filter rows | `df[df["col"] > value]` | Conditional filtering |
| Query syntax | `df.query("col > 10 and city == 'Delhi'")` | SQL-like filtering |

---

### ðŸ’¡ Key Takeaway

Mastering **data selection and filtering** is the foundation of working with Pandas.  
Once youâ€™re confident with `loc[]`, `iloc[]`, and `.query()`, the rest of Pandas becomes much easier.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('data.xlsx')
df

,Actor,Film,Year,Genre,Box Office,IMDb Rating
0,Leonardo DiCaprio,Inception,2010,Sci-Fi,$829M,8.8
1,Robert Downey Jr.,Iron Man,2008,Action,$585M,7.9
2,Tom Hanks,Forrest Gump,1994,Drama,$678M,8.8
3,Scarlett Johansson,Lucy,2014,Sci-Fi,$463M,6.4
4,Chris Evans,Captain America: Civil War,2016,Action,$1.15B,7.8
5,Christian Bale,The Dark Knight,2008,Action,$1.01B,9.0
6,Brad Pitt,Fight Club,1999,Drama,$101M,8.8
7,Johnny Depp,Pirates of the Caribbean,2003,Adventure,$654M,8.1
8,Matt Damon,The Martian,2015,Sci-Fi,$630M,8.0
9,Keanu Reeves,John Wick,2014,Action,$86M,7.4
10,Hugh Jackman,Logan,2017,Action,$619M,8.1
11,Emma Stone,La La Land,2016,Romance,$472M,8.0
12,Morgan Freeman,The Shawshank Redemption,1994,Drama,$73M,9.3
13,Will Smith,Men in Black,1997,Sci-Fi,$589M,7.3
14,Gal Gadot,Wonder Woman,2017,Action,$822M,7.4

####  Selecting Columns

In [5]:
df['Actor']

0      Leonardo DiCaprio
1      Robert Downey Jr.
2              Tom Hanks
3     Scarlett Johansson
4            Chris Evans
5         Christian Bale
6              Brad Pitt
7            Johnny Depp
8             Matt Damon
9           Keanu Reeves
10          Hugh Jackman
11            Emma Stone
12        Morgan Freeman
13            Will Smith
14             Gal Gadot
Name: Actor, dtype: object

In [11]:
df['Actor'][3]                        # It returns copy not changes OG data

'Scarlett Johansson'

In [12]:
df[['Actor','Film']]                  # Selecting multi columns

                 Actor                        Film
0    Leonardo DiCaprio                   Inception
1    Robert Downey Jr.                    Iron Man
2            Tom Hanks                Forrest Gump
3   Scarlett Johansson                        Lucy
4          Chris Evans  Captain America: Civil War
5       Christian Bale             The Dark Knight
6            Brad Pitt                  Fight Club
7          Johnny Depp    Pirates of the Caribbean
8           Matt Damon                 The Martian
9         Keanu Reeves                   John Wick
10        Hugh Jackman                       Logan
11          Emma Stone                  La La Land
12      Morgan Freeman    The Shawshank Redemption
13          Will Smith                Men in Black
14           Gal Gadot                Wonder Woman

#### Selecting Rows by Index
For working with rows use (loc) or (iloc) in pandas

In [16]:
df.loc[1]                                # It finds with row lables

Actor          Robert Downey Jr.
Film                    Iron Man
Year                        2008
Genre                     Action
Box Office                 $585M
IMDb Rating                  7.9
Name: 1, dtype: object

In [17]:
df.iloc[1]                                 # It finds with index

Actor          Robert Downey Jr.
Film                    Iron Man
Year                        2008
Genre                     Action
Box Office                 $585M
IMDb Rating                  7.9
Name: 1, dtype: object

#### Select Specific Rows and Columns

In [22]:
df.loc[1, 'Actor']                  # First = Row / Second = Column Name

'Robert Downey Jr.'

In [23]:
df.iloc[1, 0]                       # Second is column index which st from 0

'Robert Downey Jr.'

In [25]:
df.iloc[0:6, 0:3]                  # We can also do slicing with its like list slicing

                Actor                        Film  Year
0   Leonardo DiCaprio                   Inception  2010
1   Robert Downey Jr.                    Iron Man  2008
2           Tom Hanks                Forrest Gump  1994
3  Scarlett Johansson                        Lucy  2014
4         Chris Evans  Captain America: Civil War  2016
5      Christian Bale             The Dark Knight  2008

#### Fast Access: 
.at and 
.iat

In [27]:
df.at[0, 'Actor']

'Leonardo DiCaprio'

In [28]:
df.iat[0, 0]

'Leonardo DiCaprio'

- It gives one element in fast way in compare to loc and iloc

##  Filtering with Conditions

In [31]:
df[df['Year']>2010]                       # Simple Filtering

,Actor,Film,Year,Genre,Box Office,IMDb Rating
3,Scarlett Johansson,Lucy,2014,Sci-Fi,$463M,6.4
4,Chris Evans,Captain America: Civil War,2016,Action,$1.15B,7.8
8,Matt Damon,The Martian,2015,Sci-Fi,$630M,8.0
9,Keanu Reeves,John Wick,2014,Action,$86M,7.4
10,Hugh Jackman,Logan,2017,Action,$619M,8.1
11,Emma Stone,La La Land,2016,Romance,$472M,8.0
14,Gal Gadot,Wonder Woman,2017,Action,$822M,7.4

In [34]:
df[df['Year']>2010]['Actor']                   # Chaining of conditions

3     Scarlett Johansson
4            Chris Evans
8             Matt Damon
9           Keanu Reeves
10          Hugh Jackman
11            Emma Stone
14             Gal Gadot
Name: Actor, dtype: object

In [3]:
df[(df['Year'] > 2010) & (df['IMDb Rating'] > 7)]                      # Multiple condition using the and or

,Actor,Film,Year,Genre,Box Office,IMDb Rating
4,Chris Evans,Captain America: Civil War,2016,Action,$1.15B,7.8
8,Matt Damon,The Martian,2015,Sci-Fi,$630M,8.0
9,Keanu Reeves,John Wick,2014,Action,$86M,7.4
10,Hugh Jackman,Logan,2017,Action,$619M,8.1
11,Emma Stone,La La Land,2016,Romance,$472M,8.0
14,Gal Gadot,Wonder Woman,2017,Action,$822M,7.4

In [43]:
df[(df['Year'] > 2010) | (df['IMDb Rating'] > 7)]                       # Using OR

,Actor,Film,Year,Genre,Box Office,IMDb Rating
0,Leonardo DiCaprio,Inception,2010,Sci-Fi,$829M,8.8
1,Robert Downey Jr.,Iron Man,2008,Action,$585M,7.9
2,Tom Hanks,Forrest Gump,1994,Drama,$678M,8.8
3,Scarlett Johansson,Lucy,2014,Sci-Fi,$463M,6.4
4,Chris Evans,Captain America: Civil War,2016,Action,$1.15B,7.8
5,Christian Bale,The Dark Knight,2008,Action,$1.01B,9.0
6,Brad Pitt,Fight Club,1999,Drama,$101M,8.8
7,Johnny Depp,Pirates of the Caribbean,2003,Adventure,$654M,8.1
8,Matt Damon,The Martian,2015,Sci-Fi,$630M,8.0
9,Keanu Reeves,John Wick,2014,Action,$86M,7.4
10,Hugh Jackman,Logan,2017,Action,$619M,8.1
11,Emma Stone,La La Land,2016,Romance,$472M,8.0
12,Morgan Freeman,The Shawshank Redemption,1994,Drama,$73M,9.3
13,Will Smith,Men in Black,1997,Sci-Fi,$589M,7.3
14,Gal Gadot,Wonder Woman,2017,Action,$822M,7.4

In [44]:
df.query("Year > 2010 or `IMDb Rating` > 7")                              # Use query for human langauge filtering

,Actor,Film,Year,Genre,Box Office,IMDb Rating
0,Leonardo DiCaprio,Inception,2010,Sci-Fi,$829M,8.8
1,Robert Downey Jr.,Iron Man,2008,Action,$585M,7.9
2,Tom Hanks,Forrest Gump,1994,Drama,$678M,8.8
3,Scarlett Johansson,Lucy,2014,Sci-Fi,$463M,6.4
4,Chris Evans,Captain America: Civil War,2016,Action,$1.15B,7.8
5,Christian Bale,The Dark Knight,2008,Action,$1.01B,9.0
6,Brad Pitt,Fight Club,1999,Drama,$101M,8.8
7,Johnny Depp,Pirates of the Caribbean,2003,Adventure,$654M,8.1
8,Matt Damon,The Martian,2015,Sci-Fi,$630M,8.0
9,Keanu Reeves,John Wick,2014,Action,$86M,7.4
10,Hugh Jackman,Logan,2017,Action,$619M,8.1
11,Emma Stone,La La Land,2016,Romance,$472M,8.0
12,Morgan Freeman,The Shawshank Redemption,1994,Drama,$73M,9.3
13,Will Smith,Men in Black,1997,Sci-Fi,$589M,7.3
14,Gal Gadot,Wonder Woman,2017,Action,$822M,7.4

In [4]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [23, 29, 35, 42, 30],
    "City": ["Delhi", "Mumbai", "Delhi", "Chennai", "Mumbai"],
    "Salary": [50000, 62000, 70000, 82000, 58000]
}

df0 = pd.DataFrame(data)

In [5]:
df0

      Name  Age     City  Salary
0    Alice   23    Delhi   50000
1      Bob   29   Mumbai   62000
2  Charlie   35    Delhi   70000
3    David   42  Chennai   82000
4      Eva   30   Mumbai   58000

In [9]:
df0[['Name', 'City']]                      # Use double bracets for multi

      Name     City
0    Alice    Delhi
1      Bob   Mumbai
2  Charlie    Delhi
3    David  Chennai
4      Eva   Mumbai

In [13]:
df0.loc[0:4, ['Name', 'Salary']]

      Name  Salary
0    Alice   50000
1      Bob   62000
2  Charlie   70000
3    David   82000
4      Eva   58000

In [15]:
df0[(df0['Age'] > 30 ) & (df0['City'] == 'Delhi')]

      Name  Age   City  Salary
2  Charlie   35  Delhi   70000

In [18]:
df0.iat[2, 0]

'Charlie'

In [20]:
df0.query('Salary < 60000')

    Name  Age    City  Salary
0  Alice   23   Delhi   50000
4    Eva   30  Mumbai   58000

In [21]:
df0.query("Age > 30 and City == 'Delhi'")

      Name  Age   City  Salary
2  Charlie   35  Delhi   70000